# FamilyUtils Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyUtils Class
Members See Also
---
Contains utilities related to family operations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class FamilyUtils
```

Visual Basic
---
```text
Public NotInheritable Class FamilyUtils
```

Visual C++
---
```text
public ref class FamilyUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FamilyUtils
# See Also
FamilyUtils Members
Autodesk.Revit.DB Namespace